podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/TSI0_MK10D10.svd.xml
            <register>
               <name>SCANC</name>
               <description>SCAN Control Register</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>AMPSC</name>
                     <description>Active Mode Prescaler\n
Input Clock Source division factor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>Divided by 1</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>Divided by 2</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Divided by 4</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>Divided by 8</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>Divided by 16</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>Divided by 32</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>Divided by 64</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>Divided by 128</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AMCLKS</name>
                     <description>Active Mode Clock Source</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>LPOSCCLK</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>MCGIRCLK</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>OSCERCLK</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Not valid</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SMOD</name>
                     <description>Scan Modulus</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00000000</name>
                           <description>Continuous Scan</description>
                           <value>0b00000000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0bXXXXXXXX</name>
                           <description>Scan Period Modulo</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EXTCHRG</name>
                     <description>External OSC Charge Current Select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXXX</name>
                           <description>2*N uA Charge current</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="EXTCHRG" > <name>REFCHRG</name> <description>Ref OSC Charge Current select</description> <bitOffset>24</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PEN</name>
               <description>Pin Enable Register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>PEN0</name>
                     <description>Pin 0 enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pin disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Pin enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="PEN0" > <name>PEN1</name> <description>Pin 1 enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN2</name> <description>Pin 2 enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN3</name> <description>Pin 3 enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN4</name> <description>Pin 4 enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN5</name> <description>Pin 5 enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN6</name> <description>Pin 6 enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN7</name> <description>Pin 7 enable</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN8</name> <description>Pin 8 enable</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN9</name> <description>Pin 9 enable</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN10</name> <description>Pin 10 enable</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN11</name> <description>Pin 11 enable</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN12</name> <description>Pin 12 enable</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN13</name> <description>Pin 13 enable</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN14</name> <description>Pin 14 enable</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="PEN0" > <name>PEN15</name> <description>Pin 15 enable</description> <bitOffset>15</bitOffset> </field>
                  <field>
                     <name>LPSP</name>
                     <description>Low-Power Scan Pin\n
Selects which input is active in low-power mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0bXXXX</name>
                           <description>Active pin number</description>
                           <isDefault>true</isDefault>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WUCNTR</name>
               <description>Wake-Up Channel Counter Register</description>
               <addressOffset>0xC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WUCNT</name>
                     <description>Touch Sensing Wake-Up Channel 16-bit Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>1,3,5,7,9,11,13,15</dimIndex>
               <name>CNTR%s</name>
               <description>Counter Register %s</description>
               <addressOffset>0x100</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CTN1</name>
                     <description>Touch Sensing Channel %s-1 16-bit Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>CTN</name>
                     <description>Touch Sensing Channel %s 16-bit Counter Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>THRESHOLD</name>
               <description>Low Power Channel Threshold Register</description>
               <addressOffset>0x120</addressOffset>
               <fields>
                  <field>
                     <name>HTHH</name>
                     <description>High Threshold Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>LTHH</name>
                     <description>Low Threshold Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
